{
    "subject": "ELA",
    "grade_level": 9,
    "taxonomy": {
        "College_and_Career_Readiness_Anchor_Standards_for_Reading": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Key_Ideas_and_Details": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.R.1",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual evidence when writing or speaking to support conclusions drawn from the text.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.R.2",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Determine central ideas or themes of a text and analyze their development; summarize the key supporting details and ideas.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.R.3",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze how and why individuals, events, and ideas develop and interact over the course of a text.",
                            "node_type": "core"
                        }
                    ]
                },
                "Craft_and_Structure": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.R.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.R.5",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.R.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Assess how point of view or purpose shapes the content and style of a text.",
                            "node_type": "core"
                        }
                    ]
                },
                "Integration_of_Knowledge_and_Ideas": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.R.7",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.R.8",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.R.9",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take.",
                            "node_type": "core"
                        }
                    ]
                },
                "Range_of_Reading_and_Level_of_Text_Complexity": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.R.10",
                            "grade_level": 9,
                            "type": "core",
                            "description": "10. Read and comprehend complex literary and informational texts independently and proficiently.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        },
        "Reading_Standards_for_Literature": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Key_Ideas_and_Details": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RL.9-10.1",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text.",
                            "node_type": "core"
                        },
                        {
                            "label": "RL.9-10.2",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Determine a theme or central idea of a text and analyze in detail its development over the course of the text, including how it emerges and is shaped and refined by specific details; provide an objective summary of the text.",
                            "node_type": "core"
                        },
                        {
                            "label": "RL.9-10.3",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze how complex characters (e.g., those with multiple or conflicting motivations) develop over the course of a text, interact with other characters, and advance the plot or develop the theme.",
                            "node_type": "core"
                        }
                    ]
                },
                "Craft_and_Structure": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RL.9-10.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Determine the meaning of words and phrases as they are used in the text, including figurative and connotative meanings; analyze the cumulative impact of specific word choices on meaning and tone (e.g., how the language evokes a sense of time and place; how it sets a formal or informal tone).",
                            "node_type": "core"
                        },
                        {
                            "label": "RL.9-10.5",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze how an author's choices concerning how to structure a text, order events within it (e.g., parallel plots), and manipulate time (e.g., pacing, flashbacks) create such effects as mystery, tension, or surprise.",
                            "node_type": "core"
                        },
                        {
                            "label": "RL.9-10.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze a particular point of view or cultural experience reflected in a work of literature from outside the United States, drawing on a wide reading of world literature.",
                            "node_type": "core"
                        }
                    ]
                },
                "Integration_of_Knowledge_and_Ideas": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RL.9-10.7",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze the representation of a subject or a key scene in two different artistic mediums, including what is emphasized or absent in each treatment (e.g., Auden's &quot;Musée des Beaux Arts&quot; and Breughel's Landscape with the Fall of Icarus).",
                            "node_type": "core"
                        },
                        {
                            "label": "(Not applicable to literature)",
                            "grade_level": 9,
                            "type": "core",
                            "description": "(Not applicable to literature)",
                            "node_type": "core"
                        },
                        {
                            "label": "RL.9-10.9",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze how an author draws on and transforms source material in a specific work (e.g., how Shakespeare treats a theme or topic from Ovid or the Bible or how a later author draws on a play by Shakespeare).",
                            "node_type": "core"
                        }
                    ]
                },
                "Range_of_Reading_and_Level_of_Text_Complexity": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RL.9-10.10",
                            "grade_level": 9,
                            "type": "core",
                            "description": "10. By the end of grade 9, read and comprehend literature, including stories, dramas, and poems, in the grades 9—10 text complexity band proficiently, with scaffolding as needed at the high end of the range.&lt;br/&gt;&lt;br/&gt;By the end of grade 10, read and comprehend literature, including stories, dramas, and poems, at the high end of the grades 9—10 text complexity band independently and proficiently.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        },
        "Reading_Standards_for_Informational_Text": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Key_Ideas_and_Details": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RI.9-10.1",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text.",
                            "node_type": "core"
                        },
                        {
                            "label": "RI.9-10.2",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Determine a central idea of a text and analyze its development over the course of the text, including how it emerges and is shaped and refined by specific details; provide an objective summary of the text.",
                            "node_type": "core"
                        },
                        {
                            "label": "RI.9-10.3",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze how the author unfolds an analysis or series of ideas or events, including the order in which the points are made, how they are introduced and developed, and the connections that are drawn between them.",
                            "node_type": "core"
                        }
                    ]
                },
                "Craft_and_Structure": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RI.9-10.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Determine the meaning of words and phrases as they are used in a text,including figurative, connotative, and technical meanings; analyze thecumulative impact of specific word choices on meaning and tone (e.g., how the language of a court opinion differs from that of a newspaper).",
                            "node_type": "core"
                        },
                        {
                            "label": "RI.9-10.5",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze in detail how an author's ideas or claims are developed and refined byparticular sentences, paragraphs, or larger portions of a text (e.g., a section orchapter).",
                            "node_type": "core"
                        },
                        {
                            "label": "RI.9-10.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Determine an author's point of view or purpose in a text and analyze how anauthor uses rhetoric to advance that point of view or purpose.",
                            "node_type": "core"
                        }
                    ]
                },
                "Integration_of_Knowledge_and_Ideas": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RI.9-10.7",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze various accounts of a subject told in different mediums (e.g., aperson's life story in both print and multimedia), determining which details areemphasized in each account.",
                            "node_type": "core"
                        },
                        {
                            "label": "RI.9-10.8",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Delineate and evaluate the argument and specific claims in a text, assessingwhether the reasoning is valid and the evidence is relevant and sufficient;identify false statements and fallacious reasoning.",
                            "node_type": "core"
                        },
                        {
                            "label": "RI.9-10.9",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze seminal U.S. documents of historical and literary significance (e.g.,Washington's Farewell Address, the Gettysburg Address, Roosevelt's FourFreedoms speech, King's &quot;Letter from Birmingham Jail&quot;), including how theyaddress related themes and concepts.",
                            "node_type": "core"
                        }
                    ]
                },
                "Range_of_Reading_and_Level_of_Text_Complexity": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RI.9-10.10",
                            "grade_level": 9,
                            "type": "core",
                            "description": "10. By the end of grade 9, read and comprehend literary nonfiction in the grades9—10 text complexity band proficiently, with scaffolding as needed at the highend of the range.&lt;br/&gt;By the end of grade 10, read and comprehend literary nonfiction at the highend of the grades 9—10 text complexity band independently and proficiently.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        },
        "Reading_Standards_for_Literacy_in_HistorySocial_Studies_612": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Key_Ideas_and_Details": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RH.9-10.1",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Cite specific textual evidence to support analysis of primary and secondary sources, attending to such features as the date and origin of the information.",
                            "node_type": "core"
                        },
                        {
                            "label": "RH.9-10.2",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Determine the central ideas or information of a primary or secondary source; provide an accurate summary of how key events or ideas develop over the course of the text.",
                            "node_type": "core"
                        },
                        {
                            "label": "RH.9-10.3",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze in detail a series of events described in a text; determine whether earlier events caused later ones or simply preceded them.",
                            "node_type": "core"
                        }
                    ]
                },
                "Craft_and_Structure": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RH.9-10.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Determine the meaning of words and phrases as they are used in a text, including vocabulary describing political, social, or economic aspects of history/social studies.",
                            "node_type": "core"
                        },
                        {
                            "label": "RH.9-10.5",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze how a text uses structure to emphasize key points or advance an explanation or analysis",
                            "node_type": "core"
                        },
                        {
                            "label": "RH.9-10.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Compare the point of view of two or more authors for how they treat the same or similar topics, including which details they include and emphasize in their respective accounts.",
                            "node_type": "core"
                        }
                    ]
                },
                "Integration_of_Knowledge_and_Ideas": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RH.9-10.7",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Integrate quantitative or technical analysis (e.g., charts, research data) with qualitative analysis in print or digital text.",
                            "node_type": "core"
                        },
                        {
                            "label": "RH.9-10.8",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Assess the extent to which the reasoning and evidence in a text support the author's claims.",
                            "node_type": "core"
                        },
                        {
                            "label": "RH.9-10.9",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Compare and contrast treatments of the same topic in several primary and secondary sources.",
                            "node_type": "core"
                        }
                    ]
                },
                "Range_of_Reading_and_Level_of_Text_Complexity": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RH.9-10.10",
                            "grade_level": 9,
                            "type": "core",
                            "description": "10. By the end of grade 10, read and comprehend history/social studies texts in the grades 9—10 text complexity band independently and proficiently.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        },
        "Reading_Standards_for_Literacy_in_Science_and_Technical_Subjects_612": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Key_Ideas_and_Details": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RST.9-10.1",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Cite specific textual evidence to support analysis of science and technical texts, attending to the precise details of explanations or descriptions.",
                            "node_type": "core"
                        },
                        {
                            "label": "RST.9-10.2",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Determine the central ideas or conclusions of a text; trace the text's explanation or depiction of a complex process, phenomenon, or concept; provide an accurate summary of the text.",
                            "node_type": "core"
                        },
                        {
                            "label": "RST.9-10.3",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Follow precisely a complex multistep procedure when carrying out experiments, taking measurements, or performing technical tasks, attending to special cases or exceptions defined in the text.",
                            "node_type": "core"
                        }
                    ]
                },
                "Craft_and_Structure": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RST.9-10.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Determine the meaning of symbols, key terms, and other domain-specific words and phrases as they are used in a specific scientific or technical context relevant to grades 9—10 texts and topics.",
                            "node_type": "core"
                        },
                        {
                            "label": "RST.9-10.5",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze the structure of the relationships among concepts in a text, including relationships among key terms (e.g., force, friction, reaction force, energy).",
                            "node_type": "core"
                        },
                        {
                            "label": "RST.9-10.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Analyze the author's purpose in providing an explanation, describing a procedure, or discussing an experiment in a text, defining the question the author seeks to address.",
                            "node_type": "core"
                        }
                    ]
                },
                "Integration_of_Knowledge_and_Ideas": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RST.9-10.7",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Translate quantitative or technical information expressed in words in a text into visual form (e.g., a table or chart) and translate information expressed visually or mathematically (e.g., in an equation) into words.",
                            "node_type": "core"
                        },
                        {
                            "label": "RST.9-10.8",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Assess the extent to which the reasoning and evidence in a text support the author's claim or a recommendation for solving a scientific or technical problem.",
                            "node_type": "core"
                        },
                        {
                            "label": "RST.9-10.9",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Compare and contrast findings presented in a text to those from other sources (including their own experiments), noting when the findings support or contradict previous explanations or accounts.",
                            "node_type": "core"
                        }
                    ]
                },
                "Range_of_Reading_and_Level_of_Text_Complexity": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "RST.9-10.10",
                            "grade_level": 9,
                            "type": "core",
                            "description": "10. By the end of grade 10, read and comprehend science/technical texts in the grades 9—10 text complexity band independently and proficiently.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        },
        "College_and_Career_Readiness_Anchor_Standards_for_Writing": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Text_Types_and_Purposes": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.W.1",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Write arguments to support claims in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.W.2",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Write informative/explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.W.3",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well-structured event sequences.",
                            "node_type": "core"
                        }
                    ]
                },
                "Production_and_Distribution_of_Writing": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.W.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.W.5",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.W.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Use technology, including the Internet, to produce and publish writing and to interact and collaborate with others.",
                            "node_type": "core"
                        }
                    ]
                },
                "Research_to_Build_and_Present_Knowledge": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.W.7",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Conduct short as well as more sustained research projects based on focused questions, demonstrating understanding of the subject under investigation.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.W.8",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Gather relevant information from multiple print and digital sources, assess the credibility and accuracy of each source, and integrate the information while avoiding plagiarism.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.W.9",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Draw evidence from literary or informational texts to support analysis, reflection, and research.",
                            "node_type": "core"
                        }
                    ]
                },
                "Range_of_Writing": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.W.10",
                            "grade_level": 9,
                            "type": "core",
                            "description": "10. Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        },
        "Writing_Standards": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Text_Types_and_Purposes": {
                    "grade_level": 9,
                    "type": "core",
                    "subtopics": {
                        "W9-101": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "W.9-10.1a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Introduce precise claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that establishes clear relationships among claim(s), counterclaims, reasons, and evidence.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.1b",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Develop claim(s) and counterclaims fairly, supplying evidence for each while pointing out the strengths and limitations of both in a manner that anticipates the audience's knowledge level and concerns.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.1c",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use words, phrases, and clauses to link the major sections of the text, create cohesion, and clarify the relationships between claim(s) and reasons, between reasons and evidence, and between claim(s) and counterclaims.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.1d",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.1e",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Provide a concluding statement or section that follows from and supports the argument presented.",
                                    "node_type": "core"
                                }
                            ]
                        },
                        "W9-102": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "W.9-10.2a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Introduce a topic; organize complex ideas, concepts, and information to make important connections and distinctions; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.2b",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Develop the topic with well-chosen, relevant, and sufficient facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience's knowledge of the topic.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.2c",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use appropriate and varied transitions to link the major sections of the text, create cohesion, and clarify the relationships among complex ideas and concepts.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.2d",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use precise language and domain-specific vocabulary to manage the complexity of the topic.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.2e",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.2f",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Provide a concluding statement or section that follows from and supports the information or explanation presented (e.g., articulating implications or the significance of the topic).",
                                    "node_type": "core"
                                }
                            ]
                        },
                        "W9-103": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "W.9-10.3a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Engage and orient the reader by setting out a problem, situation, or observation, establishing one or multiple point(s) of view, and introducing a narrator and/or characters; create a smooth progression of experiences or events.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.3b",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use narrative techniques, such as dialogue, pacing, description, reflection, and multiple plot lines, to develop experiences, events, and/or characters.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.3c",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use a variety of techniques to sequence events so that they build on one another to create a coherent whole.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.3d",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use precise words and phrases, telling details, and sensory language to convey a vivid picture of the experiences, events, setting, and/or characters.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.3e",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Provide a conclusion that follows from and reflects on what is experienced, observed, or resolved over the course of the narrative.",
                                    "node_type": "core"
                                }
                            ]
                        }
                    }
                },
                "Production_and_Distribution_of_Writing": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "W.6.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.",
                            "node_type": "core"
                        },
                        {
                            "label": "W.9-10.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.",
                            "node_type": "core"
                        },
                        {
                            "label": "W.9-10.5",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience.",
                            "node_type": "core"
                        },
                        {
                            "label": "W.9-10.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Use technology, including the Internet, to produce, publish, and update individual or shared writing products, taking advantage of technology's capacity to link to other information and to display information flexibly and dynamically.",
                            "node_type": "core"
                        }
                    ]
                },
                "Research_to_Build_and_Present_Knowledge": {
                    "grade_level": 9,
                    "type": "core",
                    "subtopics": {
                        "W9-109": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "W.9-10.9a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Apply grades 9—10 Reading standards to literature (e.g., &quot;Analyze how an author draws on and transforms source material in a specific work [e.g., how Shakespeare treats a theme or topic from Ovid or the Bible or how a later author draws on a play by Shakespeare]&quot;).",
                                    "node_type": "core"
                                },
                                {
                                    "label": "W.9-10.9b",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Apply grades 9—10 Reading standards to literary nonfiction (e.g., &quot;Delineate and evaluate the argument and specific claims in a text, assessing whether the reasoning is valid and the evidence is relevant and sufficient; identify false statements and fallacious reasoning&quot;).",
                                    "node_type": "core"
                                }
                            ]
                        }
                    },
                    "concepts": [
                        {
                            "label": "W.9-10.7",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation.",
                            "node_type": "core"
                        },
                        {
                            "label": "W.9-10.8",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the usefulness of each source in answering the research question; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and following a standard format for citation.",
                            "node_type": "core"
                        }
                    ]
                },
                "Range_of_Writing": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "W.9-10.10",
                            "grade_level": 9,
                            "type": "core",
                            "description": "10. Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        },
        "Writing_Standards_for_Literacy_in_HistorySocial_Studies_Science_and_Technical_Subjects_612": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Text_Types_and_Purposes": {
                    "grade_level": 9,
                    "type": "core",
                    "subtopics": {
                        "WHST9-101": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "WHST.9-10.1a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Introduce precise claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that establishes clear relationships among the claim(s), counterclaims, reasons, and evidence.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "WHST.9-10.1b",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Develop claim(s) and counterclaims fairly, supplying data and evidence for each while pointing out the strengths and limitations of both claim(s) and counterclaims in a discipline-appropriate form and in a manner that anticipates the audience's knowledge level and concerns.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "WHST.9-10.1c",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use words, phrases, and clauses to link the major sections of the text, create cohesion, and clarify the relationships between claim(s) and reasons, between reasons and evidence, and between claim(s) and counterclaims.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "WHST.9-10.1d",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "WHST.9-10.1e",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Provide a concluding statement or section that follows from or supports the argument presented.",
                                    "node_type": "core"
                                }
                            ]
                        },
                        "WHST9-102": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "WHST.9-10.2a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Introduce a topic and organize ideas, concepts, and information to make important connections and distinctions; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "WHST.9-10.2b",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Develop the topic with well-chosen, relevant, and sufficient facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience's knowledge of the topic.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "WHST.9-10.2c",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use varied transitions and sentence structures to link the major sections of the text, create cohesion, and clarify the relationships among ideas and concepts.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "WHST.9-10.2d",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use precise language and domain-specific vocabulary to manage the complexity of the topic and convey a style appropriate to the discipline and context as well as to the expertise of likely readers.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "WHST.9-10.2e",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "WHST.9-10.2f",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Provide a concluding statement or section that follows from and supports the information or explanation presented (e.g., articulating implications or the significance of the topic).",
                                    "node_type": "core"
                                }
                            ]
                        }
                    }
                },
                "Production_and_Distribution_of_Writing": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "WHST.9-10.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.",
                            "node_type": "core"
                        },
                        {
                            "label": "WHST.9-10.5",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience.",
                            "node_type": "core"
                        },
                        {
                            "label": "WHST.9-10.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Use technology, including the Internet, to produce, publish, and update individual or shared writing products, taking advantage of technology's capacity to link to other information and to display information flexibly and dynamically.",
                            "node_type": "core"
                        }
                    ]
                },
                "Research_to_Build_and_Present_Knowledge": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "WHST.9-10.7",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation.",
                            "node_type": "core"
                        },
                        {
                            "label": "WHST.9-10.8",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the usefulness of each source in answering the research question; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and following a standard format for citation.",
                            "node_type": "core"
                        },
                        {
                            "label": "WHST.9-10.9",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Draw evidence from informational texts to support analysis, reflection, and research.",
                            "node_type": "core"
                        }
                    ]
                },
                "Range_of_Writing": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "WHST.9-10.10",
                            "grade_level": 9,
                            "type": "core",
                            "description": "10. Write routinely over extended time frames (time for reflection and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        },
        "College_and_Career_Readiness_Anchor_Standards_for_Speaking_and_Listening": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Comprehension_and_Collaboration": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.SL.1",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.SL.2",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Integrate and evaluate information presented in diverse media and formats, including visually, quantitatively, and orally.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.SL.3",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric.",
                            "node_type": "core"
                        }
                    ]
                },
                "Presentation_of_Knowledge_and_Ideas": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.SL.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.SL.5",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Make strategic use of digital media and visual displays of data to express information and enhance understanding of presentations.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.SL.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Adapt speech to a variety of contexts and communicative tasks, demonstrating command of formal English when indicated or appropriate.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        },
        "Speaking_and_Listening_Standards": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Comprehension_and_Collaboration": {
                    "grade_level": 9,
                    "type": "core",
                    "subtopics": {
                        "SL9-101": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "SL.9-10.1a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Come to discussions prepared, having read and researched material under study; explicitly draw on that preparation by referring to evidence from texts and other research on the topic or issue to stimulate a thoughtful, well-reasoned exchange of ideas.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "SL.9-10.1b",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Work with peers to set rules for collegial discussions and decision-making (e.g., informal consensus, taking votes on key issues, presentation of alternate views), clear goals and deadlines, and individual roles as needed.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "SL.9-10.1c",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Propel conversations by posing and responding to questions that relate the current discussion to broader themes or larger ideas; actively incorporate others into the discussion; and clarify, verify, or challenge ideas and conclusions.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "SL.9-10.1d",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Respond thoughtfully to diverse perspectives, summarize points of agreement and disagreement, and, when warranted, qualify or justify their own views and understanding and make new connections in light of the evidence and reasoning presented.",
                                    "node_type": "core"
                                }
                            ]
                        }
                    },
                    "concepts": [
                        {
                            "label": "SL.9-10.2",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Integrate multiple sources of information presented in diverse media or formats (e.g., visually, quantitatively, orally) evaluating the credibility and accuracy of each source.",
                            "node_type": "core"
                        },
                        {
                            "label": "SL.9-10.3",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric, identifying any fallacious reasoning or exaggerated or distorted evidence.",
                            "node_type": "core"
                        }
                    ]
                },
                "Presentation_of_Knowledge_and_Ideas": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "SL.9-10.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Present information, findings, and supporting evidence clearly, concisely, and logically such that listeners can follow the line of reasoning and the organization, development, substance, and style are appropriate to purpose, audience, and task.",
                            "node_type": "core"
                        },
                        {
                            "label": "SL.9-10.5",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Make strategic use of digital media (e.g., textual, graphical, audio, visual, and interactive elements) in presentations to enhance understanding of findings, reasoning, and evidence and to add interest.",
                            "node_type": "core"
                        },
                        {
                            "label": "SL.9-10.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        },
        "College_and_Career_Readiness_Anchor_Standards_for_Language": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Conventions_of_Standard_English": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.L.1",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Demonstrate command of the conventions of standard English grammar and usage when writing or speaking.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.L.2",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing.",
                            "node_type": "core"
                        }
                    ]
                },
                "Knowledge_of_Language": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.L.3",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening.",
                            "node_type": "core"
                        }
                    ]
                },
                "Vocabulary_Acquisition_and_Use": {
                    "grade_level": 9,
                    "type": "core",
                    "concepts": [
                        {
                            "label": "CCRA.L.4",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.L.5",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings.",
                            "node_type": "core"
                        },
                        {
                            "label": "CCRA.L.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Acquire and use accurately a range of general academic and domain-specific words and phrases sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when considering a word or phrase important to comprehension or expression.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        },
        "Language_Standards": {
            "grade_level": 9,
            "type": "core",
            "subtopics": {
                "Conventions_of_Standard_English": {
                    "grade_level": 9,
                    "type": "core",
                    "subtopics": {
                        "L9-101": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "L.9-10.1a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use parallel structure.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "L.9-10.1b",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use various types of phrases (noun, verb, adjectival, adverbial, participial, prepositional, absolute) and clauses (independent, dependent; noun, relative, adverbial) to convey specific meanings and add variety and interest to writing or presentations.",
                                    "node_type": "core"
                                }
                            ]
                        },
                        "L9-102": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "L.9-10.2a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use a semicolon (and perhaps a conjunctive adverb) to link two or more closely related independent clauses.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "L.9-10.2b",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use a colon to introduce a list or quotation.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "L.9-10.2c",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Spell correctly.",
                                    "node_type": "core"
                                }
                            ]
                        }
                    }
                },
                "Knowledge_of_Language": {
                    "grade_level": 9,
                    "type": "core",
                    "subtopics": {
                        "L9-103": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "L.9-10.3a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Write and edit work so that it conforms to the guidelines in a style manual (e.g., MLA Handbook, Turabian's Manual for Writers) appropriate for the discipline and writing type.",
                                    "node_type": "core"
                                }
                            ]
                        }
                    }
                },
                "Vocabulary_Acquisition_and_Use": {
                    "grade_level": 9,
                    "type": "core",
                    "subtopics": {
                        "L9-104": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "L.9-10.4a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Use context (e.g., the overall meaning of a sentence, paragraph, or text; a word's position or function in a sentence) as a clue to the meaning of a word or phrase.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "L.9-10.4b",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Identify and correctly use patterns of word changes that indicate different meanings or parts of speech (e.g., analyze, analysis, analytical; advocate, advocacy).",
                                    "node_type": "core"
                                },
                                {
                                    "label": "L.9-10.4c",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Consult general and specialized reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation of a word or determine or clarify its precise meaning, its part of speech, or its etymology.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "L.9-10.4d",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Verify the preliminary determination of the meaning of a word or phrase (e.g., by checking the inferred meaning in context or in a dictionary).",
                                    "node_type": "core"
                                }
                            ]
                        },
                        "L9-105": {
                            "grade_level": 9,
                            "type": "core",
                            "concepts": [
                                {
                                    "label": "L.9-10.5a",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Interpret figures of speech (e.g., euphemism, oxymoron) in context and analyze their role in the text.",
                                    "node_type": "core"
                                },
                                {
                                    "label": "L.9-10.5b",
                                    "grade_level": 9,
                                    "type": "core",
                                    "description": "Analyze nuances in the meaning of words with similar denotations.",
                                    "node_type": "core"
                                }
                            ]
                        }
                    },
                    "concepts": [
                        {
                            "label": "L.9-10.6",
                            "grade_level": 9,
                            "type": "core",
                            "description": "Acquire and use accurately general academic and domain-specific words and phrases, sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when considering a word or phrase important to comprehension or expression.",
                            "node_type": "core"
                        }
                    ]
                }
            }
        }
    }
}